/* eslint-disable max-len */
exports.initialize = (syncForse, db) => {
  if (syncForse) {
    const { Op } = db.Sequelize

    // roles
    db.role.create({ id: 1, name: 'user', title: 'користувач' })
    db.role.create({ id: 2, name: 'admin', title: 'адміністратор' })
    db.role.create({ id: 3, name: 'pm', title: 'менеджер' })

    // users
    db.user.create({
      id: 1,
      name: 'Віталій Савенець',
      email: 'admin@gmail.com',
      phone: '0984070702',
      password: '$2a$08$C/9WjZBCXEEr2wsD9jIV0eyZxw.c5w6IVdIv7QAT090cmyTtQ2w6.',
      is_confirmed: 'Y',
      is_archived: 'N'
    }).then((user) => {
      db.role.findAll({
        where: { name: { [Op.or]: ['admin'] } }
      }).then((roles) => {
        user.setRoles(roles)
      })
    })
    db.user.create({
      id: 2,
      name: 'Микола Вирвидуб',
      email: 'test@gmail.com',
      phone: '0635657020',
      password: '$2a$08$C/9WjZBCXEEr2wsD9jIV0eyZxw.c5w6IVdIv7QAT090cmyTtQ2w6.',
      is_confirmed: 'N',
      is_archived: 'N'
    }).then((user) => {
      db.role.findAll({
        where: { name: { [Op.or]: ['user'] } }
      }).then((roles) => {
        user.setRoles(roles)
      })
    })
    db.user.create({
      id: 3,
      name: 'Матвій Асаул',
      email: 'test1@gmail.com',
      phone: '0635657021',
      password: '$2a$08$C/9WjZBCXEEr2wsD9jIV0eyZxw.c5w6IVdIv7QAT090cmyTtQ2w6.',
      is_confirmed: 'N',
      is_archived: 'N'
    }).then((user) => {
      db.role.findAll({
        where: { name: { [Op.or]: ['user'] } }
      }).then((roles) => {
        user.setRoles(roles)
      })
    })
    db.user.create({
      id: 4,
      name: 'Михайло Писар',
      email: 'test2@gmail.com',
      phone: '0635657022',
      password: '$2a$08$C/9WjZBCXEEr2wsD9jIV0eyZxw.c5w6IVdIv7QAT090cmyTtQ2w6.',
      is_confirmed: 'N',
      is_archived: 'N'
    }).then((user) => {
      db.role.findAll({
        where: { name: { [Op.or]: ['user'] } }
      }).then((roles) => {
        user.setRoles(roles)
      })
    })
    db.user.create({
      id: 5,
      name: 'Павло Фастовець',
      email: 'test3@gmail.com',
      phone: '0635657023',
      password: '$2a$08$C/9WjZBCXEEr2wsD9jIV0eyZxw.c5w6IVdIv7QAT090cmyTtQ2w6.',
      is_confirmed: 'N',
      is_archived: 'N'
    }).then((user) => {
      db.role.findAll({
        where: { name: { [Op.or]: ['user'] } }
      }).then((roles) => {
        user.setRoles(roles)
      })
    })

    // messages
    db.message.create({
      id: 1,
      email: 'test@gmail.com',
      message: 'Швидко працює!',
      user_id: 2
    })
    db.message.create({
      id: 2,
      email: 'test1@gmail.com',
      message: 'Те що треба!',
      user_id: 3
    })
    db.message.create({
      id: 3,
      email: 'test2@gmail.com',
      message: 'Непогано але можна було і краще!',
      user_id: 4
    })
    db.message.create({
      id: 4,
      email: 'test3@gmail.com',
      message: 'Якщо це дипломний проект то треба поставити хорошу оцінку',
      user_id: 5
    })
    db.message.create({
      id: 5,
      email: 'CO2@gmail.com',
      message: 'Чудовий сайт!'
    })

    // categories
    db.category.create({ id: 1, name: 'Гумі' })
    db.category.create({ id: 2, name: 'Дика маслина' })
    db.category.create({ id: 3, name: 'Обліпиха' })
    db.category.create({ id: 4, name: 'Ожина' })
    db.category.create({ id: 5, name: 'Кизил' })
    db.category.create({ id: 6, name: 'Гібіскус' })
    db.category.create({ id: 7, name: 'Інжир' })

    // plants
    db.plant.create({
      id: 1,
      category_id: 1,
      name: 'Гуцулка',
      notes: 'Само-плідний сорт пізнього строку дозрівання. Ягода велика, видовжена на довгих плодоніжках, які міцно тримаються деревини. Відрив сухий. Свіжими зберігаються до 30 днів. Смак солодко-кислий, злегка в’яжучий.',
      user_id: 2
    })
    db.plant.create({
      id: 2,
      category_id: 1,
      name: 'Лонгинка',
      notes: 'Сорт пізнього строку дозрівання. Ягоди майже круглі, середнього розміру. Самий врожайний з усіх сортів. Дозріває на початку липня. Ягоди міцно тримаються дерева, але відрив сухий. Смак солодкий, злегка в’яжучий.',
      user_id: 3
    })
    db.plant.create({
      id: 3,
      category_id: 1,
      name: 'Львівяночка',
      notes: 'Середньо спілий сорт. Врожайність дуже висока. З самими більшими видовженими плодами. Дозрівають з середини до кінця червня, свіжими можна зберігати до двох тижнів. Смакові якості високі. Відрив легкий та сухий. Ягоди можна рвати жменями.',
      user_id: 2
    })
    db.plant.create({
      id: 4,
      category_id: 2,
      name: 'Аморро',
      notes: 'Дерево або кущ до 3 м. висотою. Рясно родить щороку. Ягода червоного кольору до 6 мм. в діаметрі. За смаком схожі на плоди гранату. Лікувальна дія прирівнюється до обліпихи, але ягода набагато смачніша.',
      user_id: 2
    })
    db.plant.create({
      id: 5,
      category_id: 2,
      name: 'Фортунелла',
      notes: 'Дерево або кущ до 3 м. висотою. Рясно родить щороку. Ягода жовтого кольору до 6 мм. в діаметрі. За смаком схожі на плоди гранату. Лікувальна дія прирівнюється до обліпихи, але ягода набагато смачніша.',
      user_id: 4
    })
    db.plant.create({
      id: 6,
      category_id: 2,
      name: 'Світ енд Соур',
      notes: 'Дерево або кущ до 3 м. висотою. Рясно родить щороку. Ягода червоного кольору до 6 мм. в діаметрі. За смаком схожі на плоди гранату. Лікувальна дія прирівнюється до обліпихи, але ягода набагато смачніша. 2-річні саджанці.',
      user_id: 2
    })
    db.plant.create({
      id: 7,
      category_id: 3,
      name: 'Ботанічна ароматна',
      notes: 'Новий без колючковий сорт ожини з прямо-стоячими пагонами і дуже великою смачною ягодою. Кущ має велику силу росту. Середнього строку дозрівання. Ягода до 15г, трохи видовженої форми, чорна, блискуча, солодка.',
      user_id: 2
    })
    db.plant.create({
      id: 8,
      category_id: 3,
      name: 'Либідь',
      notes: 'Ранній сорт, дозріває з кінця липня - початок серпня. Дерево слаборосле, висотою 2,5 м., Без шипів. Ягода кисло - солодкого смаку, оранжевого кольору, овальної форми, масою 0,8 г. Дегустаційна оцінка 4,5 бала. Відрив ягід сухий.',
      user_id: 2
    })
    db.plant.create({
      id: 9,
      category_id: 3,
      name: 'Обрій',
      notes: 'Чоловіче сильно-росле дерево з розтягнутим періодом запилення. Ягоди на жіночих сортах при запиленні Обрієм додають у вазі та розмірові. Запилювач Високоросле чоловіче дерево для запилення.',
      user_id: 2
    })
    db.plant.create({
      id: 10,
      category_id: 4,
      name: 'Апачі',
      notes: 'Новий без колючковий сорт ожини з прямо-стоячими пагонами і дуже великою смачною ягодою. Кущ має велику силу росту. Середнього строку дозрівання. Ягода до 15г, трохи видовженої форми, чорна, блискуча, солодка.',
      user_id: 2
    })
    db.plant.create({
      id: 11,
      category_id: 4,
      name: 'Арапахо',
      notes: 'Сорт прямо-стоячий, не колючий. Висота до 3 метрів. Середнього строку дозрівання. Розтягнуте плодоношення: 50–60 днів. Ягода до 15 г. Чорна, блискуча, високих смакових якостей, нагадує смак черешні. Висока транспортабельність, ягоди можуть бути зірвані до 7 днів і не текти. В одній китиці може бути від 20 до 300 ягід. З дорослого куща можна зняти біля 30 кілограмів ягід.',
      user_id: 2
    })
    db.plant.create({
      id: 12,
      category_id: 4,
      name: 'Блек Бат Блекберрі',
      notes: 'Сорт ожини раннього терміну дозрівання, пагони стеляться, сильні, до 2,5 м, з невеликими колючками. Ягоди добре сформовані, витягнуті, надзвичайно великі, (бувають до 8 см. та 25 грамів) соковиті, з прекрасним ароматом. Хіт ягідних продаж. На зиму укривається.',
      user_id: 2
    })
    db.plant.create({
      id: 13,
      category_id: 4,
      name: 'Бронко Делікато',
      notes: 'Німецький сорт. Прямо-стоячий з великими колючками. Середнього строку дозрівання. Вирощую його понад 5 років, це один із найкращих сортів ожини. Ягоди чорні, блискучі, великі, була ягода 28 грамів. Смак солодко кислий, багатий, сильний ожиновий аромат. Красивий товарний вигляд, високий попит на ринку. Морозостійкість на рівні -22 градусів — перевірено.',
      user_id: 5
    })
    db.plant.create({
      id: 14,
      category_id: 4,
      name: 'Логанберрі чорний',
      notes: 'Сорт пізнього строку дозрівання. Дуже врожайний, до 50 кілограм ягід з куща. Сильно-рослий, на пів стоячий, не колючий. Ягода кисло-солодка, з багатим ожиновим смаком. Морозостійкість на рівні -26°C.',
      user_id: 2
    })
    db.plant.create({
      id: 15,
      category_id: 5,
      name: 'Болгарія',
      notes: 'Сорт пізній, плоди великі, темно-циліндричні, чорно-червоні, в середньому важать 9-10 г. Гарна врожайність щороку. Зимостійкість висока.',
      user_id: 2
    })
    db.plant.create({
      id: 16,
      category_id: 5,
      name: 'Кизил суничний',
      notes: 'Надзвичайно гарне цвітіння великими білими квітами (до 10 см. у діаметрі) Плоди круглі, великі (до 4 см.) висять на довгих плодоніжках (понад 10 см.) червоного кольору, схожі на суницю. Від цього і назва. м’якоть оранжева, масляниста солодка, але оболонка міцна, тонка та гірка. Тому плоди потрібно обережно обирати на подобі яйця.',
      user_id: 2
    })
    db.plant.create({
      id: 17,
      category_id: 5,
      name: 'Корнус Оффіціналіс',
      notes: 'Невелике дерево до 2,5 м. висотою. Ягоди до 2 см. зібрані у великі грона. Щорічне рясне плодоношення. Високі лікувальні властивості. Споживча стиглість ягід наступає після морозів. Плоди можуть висіти на дереві усю зиму. Тож завжди можна себе порадувати свіжою цілющою ягодою.',
      user_id: 2
    })
    db.plant.create({
      id: 18,
      category_id: 5,
      name: 'Лук’янівський клон',
      notes: 'Один із найвеликоплідніших сортів середньо-пізнього строку дозрівання.',
      user_id: 2
    })
    db.plant.create({
      id: 19,
      category_id: 5,
      name: 'Слав',
      notes: 'Надраннього строку дозрівання. Ягода темно-вишневого кольору, дуже велика, як для ранніх сортів до 12 гр.',
      user_id: 2
    })
    db.plant.create({
      id: 20,
      category_id: 5,
      name: 'Стоян',
      notes: 'Пізний великоплідний сорт. Плоди десертного смаку, темно-червоні. Можуть висіти на дереві біля двох місяців не осипаючись.',
      user_id: 2
    })
    db.plant.create({
      id: 21,
      category_id: 6,
      name: 'Болотний Трав’янистий',
      notes: 'Величезні квіти діаметром до 20-30 см. Білого, світло-рожевого, рожевого, темно-рожевого та червоного кольорів.',
      user_id: 2
    })
    db.plant.create({
      id: 22,
      category_id: 7,
      name: 'Голіаф',
      notes: 'Великоплідний сорт. Найбільша ягода була вагою 180 г. В прикопному варіанті подвійне плодоношення. У кімнатному вирощуванні три хвилі росту, відповідно і плодоношення до трьох разів.',
      user_id: 2
    })
  }
}
